app/Controllers/AdminController.php

    public function mostrarPersonasEntregasRecepciones()
    {
        $db = \Config\Database::connect();
        // Realizar consulta para obtener productos
        $PersonaQuery = $db->table('Persona')->get();
        $data['personas'] = $PersonaQuery->getResultArray();

        $RecepcionQuery = $db->table('recepcion_donaciones')->get();
        $data['recepciones'] = $RecepcionQuery->getResultArray();

        // Realizar consulta para obtener alimentos
        $EntregaQuery = $db->table('entrega_donaciones')->get();
        $data['entregas'] = $EntregaQuery->getResultArray();

        $organizacionQuery = $db->table('organizacion')->get();
        $data['organizaciones'] = $organizacionQuery->getResultArray();

        $DonacionQuery = $db->table('entrega_donaciones')
            ->join('voluntario_entrega_donacion', 'voluntario_entrega_donacion.entrega_id = entrega_donaciones.id_entrega')
            ->join('Voluntario', 'Voluntario.id_voluntario = voluntario_entrega_donacion.voluntario_id')
            ->join('Persona', 'Persona.id_persona = Voluntario.persona_id')  // Unir con la tabla 'Persona'
            ->join('Org_Receptora', 'Org_Receptora.id_org_receptora = entrega_donaciones.org_receptora_id')
            ->join('Organizacion', 'Organizacion.id_organizacion = Org_Receptora.id_org_receptora')  // Unir con la tabla 'Organizacion'
            ->select('entrega_donaciones.*, Persona.nombre as responsable_nombre, Organizacion.nombre as organizacion_nombre')
            ->get();
---
SELECT *
FROM `Persona`
SELECT *
FROM `recepcion_donaciones`
SELECT *
FROM `entrega_donaciones`
SELECT *
FROM `organizacion`
SELECT `entrega_donaciones`.*, `Persona`.`nombre` as `responsable_nombre`, `Organizacion`.`nombre` as `organizacion_nombre`
FROM `entrega_donaciones`
JOIN `voluntario_entrega_donacion` ON `voluntario_entrega_donacion`.`entrega_id` = `entrega_donaciones`.`id_entrega`
JOIN `Voluntario` ON `Voluntario`.`id_voluntario` = `voluntario_entrega_donacion`.`voluntario_id`
JOIN `Persona` ON `Persona`.`id_persona` = `Voluntario`.`persona_id`
JOIN `Org_Receptora` ON `Org_Receptora`.`id_org_receptora` = `entrega_donaciones`.`org_receptora_id`
JOIN `Organizacion` ON `Organizacion`.`id_organizacion` = `Org_Receptora`.`id_org_receptora`

    public function mostrarProductos1()
    {
        // Cargar la base de datos
        $db = \Config\Database::connect();

        // Realizar consulta para obtener productos
        $productosQuery = $db->table('Productos')->get();
        $data['productos'] = $productosQuery->getResultArray();

        // Realizar consulta para obtener alimentos
        $alimentosQuery = $db->table('Alimentos')->get();
---
SELECT *
FROM `Productos`
SELECT *
FROM `Alimentos`

    public function mostrarProductos()
    {
        $productoModel = new ProductoModel();
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Productos`