app/Controllers/HomeController.php

SELECT *
FROM `persona`
---
    public function index()
    {
        $personaModel = new PersonaModel();
        $data['personas'] = $personaModel->findAll();