app/Controllers/OrganizacionBeneficaController.php

SELECT *
FROM `Productos`
---
    public function gestionProductos()
    {
        $productoModel = new ProductoModel();
        $productos = $productoModel->findAll();

SELECT *
FROM `Alimentos`
---
    public function gestionAlimentos()
    {
        $alimentoModel = new AlimentoModel();
        $alimentos = $alimentoModel->findAll();