app/Models/AutenticacionModel.php

    public function verificar_credenciales($usuario, $contrasena)
    {
        $query = $this->where(['usuario' => $usuario, 'contrasena' => $contrasena])->get();
        return ($query->getRow() !== null);
---
SELECT *
FROM `Autenticacion`
WHERE `usuario` = 'admin'
AND `contrasena` = 'admin'

    public function obtener_tipo_usuario($usuario)
    {
        $query = $this->select('tipo_persona')->where('usuario', $usuario)->get();
        return ($query->getRow() !== null) ? $query->getRow()->tipo_persona : null;
---
SELECT `tipo_persona`
FROM `Autenticacion`
WHERE `usuario` = 'admin'

    public function obtener_id_persona($usuario)
    {

        $query = $this->select('persona_id')->where('usuario', $usuario)->get();
        $result = $query->getRow();
---
SELECT `persona_id`
FROM `Autenticacion`
WHERE `usuario` = 'admin'